import React from "react";

interface QuoteProps extends React.SVGProps<SVGSVGElement> {
  size?: number;
}

export const DubleQuote = ({ size = 153, className, ...props }: QuoteProps) => (
  <svg
    viewBox="0 0 153 122"
    width={size}
    height={(size * 122) / 153}
    fill="currentColor" // 부모의 text 컬러를 따라가도록 설정
    className={className}
    xmlns="http://www.w3.org/2000/svg"
    {...props}
  >
    <g>
      <path d="M38.1,56.3c-9.1,0-17.4,3.8-23.3,9.9c0,0-4.9-21.1,10.6-41.4C40.7,4.6,45.5,4.9,43.2,0.9c0,0-1.4-3.5-9.5,3.3 c-7.2,6.1-27.3,27.3-32,53.3c-3.4,18.8-2.2,36.3,9.7,49.5c4.4,6.5,11.1,11.2,18.9,13.2c0,0,0,0,0,0v0c2.5,0.6,5.1,1,7.8,1 c17.9,0,32.4-14.5,32.4-32.4S56.1,56.3,38.1,56.3z" />
      <path d="M120.5,56.3c-9.1,0-17.4,3.8-23.3,9.9c0,0-4.9-21.1,10.6-41.4c15.3-20.1,20.1-19.8,17.7-23.8c0,0-1.4-3.5-9.5,3.3 c-7.2,6.1-27.3,27.3-32,53.3c-3.4,18.8-2.2,36.3,9.7,49.5c4.4,6.5,11.1,11.2,18.9,13.2c0,0,0,0,0,0v0c2.5,0.6,5.1,1,7.8,1 c17.9,0,32.4-14.5,32.4-32.4S138.4,56.3,120.5,56.3z" />
    </g>
  </svg>
);
